xfire-core/src/test/org/codehaus/xfire/addressing/testcases/echo/soap11/test1150request.xml

<?xml version='1.0' ?>
<!-- $Id$ -->
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <env:Header>
  <wsa:Action>http://example.org/action/echoIn</wsa:Action>
  <wsa:MessageID>476F63B9-E46D-4A20-BDEF-CE94C1A303B1</wsa:MessageID>
  <wsa:ReplyTo>
	<wsa:Address>http://example.org/testAddress/not.anonymous</wsa:Address>
  </wsa:ReplyTo>
 </env:Header>
 <env:Body>
  <m:echo xmlns:m="http://example.org/echo">Echo This Text</m:echo>
 </env:Body>
</env:Envelope>
